app/Http/Controllers/Web/ExamController.php

    public function index(Request $request)
{
    removeContentLocale();

    $query = Quiz::query();

    // Các biến khác
    $totalQuizzes = deepClone($query)->count();
    $totalActiveQuizzes = deepClone($query)->where('status', 'active')->count();
    $totalStudents = QuizzesResult::groupBy('user_id')->count();
    $totalPassedStudents = QuizzesResult::where('status', 'passed')->groupBy('user_id')->count();

    // Lọc quiz
    $query = $this->filters($query, $request);

    // Lấy danh sách quiz
    $quizzes = $query->with([
        'webinar',
        'teacher',
        'quizQuestions',
        'quizResults',
    ])->paginate(10);

    // Lấy danh sách câu hỏi (nếu cần)
    $questions = QuizzesQuestion::all(); // Hoặc một truy vấn phù hợp với yêu cầu của bạn

    // Lấy danh sách nhóm (nếu cần)
    $groups = Group::all(); // Hoặc một truy vấn phù hợp với yêu cầu của bạn
---
select count(*) as aggregate from `quizzes_results` group by `user_id`
select count(*) as aggregate from `quizzes_results` where `status` = 'passed' group by `user_id`
select * from `webinars` where 0 = 1
select * from `quizzes_questions`
select * from `groups`