app/Http/Controllers/Admin/QuizQuestionController.php


        if (!empty($quiz)) {
            $creator = $quiz->creator;
            $order = QuizzesQuestion::query()->where('quiz_id', $quiz->id)->count() + 1;

            $quizQuestion = QuizzesQuestion::create([
                'quiz_id' => $data['quiz_id'],
                'creator_id' => $creator->id,
                'grade' => $data['grade'],
                'type' => $data['type'],
                'image' => $data['image'] ?? null,
                'video' => $data['video'] ?? null,
                'order' => $order,
                'created_at' => time()
            ]);

            if (!empty($quizQuestion)) {
                QuizzesQuestionTranslation::updateOrCreate([
                    'quizzes_question_id' => $quizQuestion->id,
                    'locale' => mb_strtolower($data['locale']),
                ], [
                    'title' => $data['title'],
                    'correct' => $data['correct'] ?? null,
                ]);
---
select count(*) as aggregate from `quizzes_questions` where `quiz_id` = 43
insert into `quizzes_questions` (`quiz_id`, `creator_id`, `grade`, `type`, `image`, `video`, `order`, `created_at`) values ('43', 929, '2', 'multiple', '', '', 3, 1735553579)
insert into `quiz_question_translations` (`quizzes_question_id`, `locale`, `title`, `correct`) values (87, 'vi', 'mmmm', '')
select * from `quiz_question_translations` where (`quizzes_question_id` = 87 and `locale` = 'vi') limit 1


                foreach ($answers as $answer) {
                    if (!empty($answer['title']) or !empty($answer['file'])) {
                        $questionAnswer = QuizzesQuestionsAnswer::create([
                            'question_id' => $quizQuestion->id,
                            'creator_id' => $creator->id,
                            'image' => $answer['file'] ?? null,
                            'correct' => isset($answer['correct']) ? true : false,
                            'created_at' => time()
                        ]);

                        if (!empty($questionAnswer)) {
                            QuizzesQuestionsAnswerTranslation::updateOrCreate([
                                'quizzes_questions_answer_id' => $questionAnswer->id,
                                'locale' => mb_strtolower($data['locale']),
                            ], [
                                'title' => $answer['title'],
                            ]);
---
insert into `quizzes_questions_answers` (`question_id`, `creator_id`, `image`, `correct`, `created_at`) values (87, 929, '', 0, 1735553579)
insert into `quizzes_questions_answer_translations` (`quizzes_questions_answer_id`, `locale`, `title`) values (237, 'vi', '1')
select * from `quizzes_questions_answer_translations` where (`quizzes_questions_answer_id` = 237 and `locale` = 'vi') limit 1

    public function edit($question_id)
    {
        $question = QuizzesQuestion::where('id', $question_id)->first();
---
select * from `quizzes_questions` where `id` = '80' limit 1

    $quiz = Quiz::where('id', $data['quiz_id'])->first();

    if (!empty($quiz)) {
        $quizQuestion = QuizzesQuestion::where('id', $id)
            ->where('quiz_id', $quiz->id)
            ->first();
---
select * from `quizzes_questions` where `id` = '80' and `quiz_id` = 43 limit 1

                'updated_at' => time()
            ]);

            QuizzesQuestionTranslation::updateOrCreate([
                'quizzes_question_id' => $quizQuestion->id,
                'locale' => mb_strtolower($data['locale']),
            ], [
                'title' => $data['title'],
                'correct' => $data['correct'] ?? null,
            ]);
---
select * from `quiz_question_translations` where (`quizzes_question_id` = 80 and `locale` = 'vi') limit 1

            $quiz->increaseTotalMark($quizQuestion->grade);

            if ($quizQuestion->type == QuizzesQuestion::$multiple and $answers) {
                $oldAnswerIds = QuizzesQuestionsAnswer::where('question_id', $quizQuestion->id)->pluck('id')->toArray();
---
select `id` from `quizzes_questions_answers` where `question_id` = 80

                            });
                        }

                        $quizQuestionsAnswer = QuizzesQuestionsAnswer::where('id', $key)->first();
---
select * from `quizzes_questions_answers` where `id` = 215 limit 1

                        }

                        if ($quizQuestionsAnswer) {
                            QuizzesQuestionsAnswerTranslation::updateOrCreate([
                                'quizzes_questions_answer_id' => $quizQuestionsAnswer->id,
                                'locale' => mb_strtolower($data['locale']),
                            ], [
                                'title' => $answer['title'],
                            ]);
---
select * from `quizzes_questions_answer_translations` where (`quizzes_questions_answer_id` = 215 and `locale` = 'vi') limit 1