app/Http/Controllers/Admin/QuizController.php

select count(*) as aggregate from `quizzes_results` group by `user_id`
select count(*) as aggregate from `quizzes_results` where `status` = 'passed' group by `user_id`
select * from `webinars` where `webinars`.`id` in (1996, 1998, 2003, 2004, 2008, 2024)
---
    public function index(Request $request)
    {
        $this->authorize('admin_quizzes_list');

        removeContentLocale();

        $query = Quiz::query();

        $totalQuizzes = deepClone($query)->count();
        $totalActiveQuizzes = deepClone($query)->where('status', 'active')->count();
        $totalStudents = QuizzesResult::groupBy('user_id')->count();
        $totalPassedStudents = QuizzesResult::where('status', 'passed')->groupBy('user_id')->count();

        $query = $this->filters($query, $request);

        $quizzes = $query->with([
            'webinar',
            'teacher',
            'quizQuestions',
            'quizResults',
        ])->paginate(10);

select * from `quizzes_questions_answers` where `quizzes_questions_answers`.`question_id` in (83, 84)
select * from `webinars` where `status` = 'active' and (`teacher_id` = 1048 or `creator_id` = 1048)
---
    public function edit(Request $request, $id)
    {
        $this->authorize('admin_quizzes_edit');

        $quiz = Quiz::query()->where('id', $id)
            ->with([
                'quizQuestions' => function ($query) {
                    $query->orderBy('order', 'asc');
                    $query->with('quizzesQuestionsAnswers');
                },
            ])
            ->first();

        if (empty($quiz)) {
            abort(404);
        }

        $creator = $quiz->creator;

        $webinars = Webinar::where('status', 'active')
            ->where(function ($query) use ($creator) {
                $query->where('teacher_id', $creator->id)
                    ->orWhere('creator_id', $creator->id);
            })->get();

select * from `sections` where (`title` = '言語知識　（もじ・ごい）' and `quiz_id` = 763) limit 1
---
    public function import(Request $request)
    {
        $request->validate([
            'file' => 'required|mimes:csv,txt',
        ]);

        $path = $request->file('file')->getRealPath();
        $data = array_map(function($line) {
            return str_getcsv($line, ",");
        }, file($path));

        foreach ($data as $row) {
            // Tạo hoặc lấy quiz
            $quiz = Quiz::updateOrCreate(
                ['title' => $row[0] ?? 'Untitled Quiz', 'creator_id' => auth()->id()],
                [
                    'info' => $row[1] ?? null,
                    'url' => $row[2] ?? null,
                    'certificate' => rand(0, 1),
                    'pass_mark' => rand(1, 100),
                    'total_mark' => rand(1, 100),
                    'created_at' => time(),
                ]
            );

            // Tạo hoặc lấy section (liên kết với quiz)
            if (!empty($row[3])) {
                $section = Section::updateOrCreate(
                    ['title' => $row[3], 'quiz_id' => $quiz->id], // Liên kết với quiz
                    [
                        'created_at' => time(),
                    ]
                );

insert into `groups` (`title`, `section_id`, `info`, `creator_id`, `created_at`) values ('問題 1', 101023, ' 　 ____の ことばは  ひらがなで  どう  かきますか。１・２・３・４から　いちばん　いい　ものを　ひとつ えらんで ください。', 1, 1735553273)
select * from `groups` where (`title` = '問題 1' and `section_id` = 101023) limit 1
---

            // Tạo hoặc lấy group (liên kết với section)
            if (!empty($row[5])) {
                $group = Group::updateOrCreate(
                    ['title' => $row[5], 'section_id' => $section->id ?? null],
                    [
                        'info' => $row[6] ?? null,
                        'creator_id' => auth()->id(),
                        'created_at' => time(),
                    ]
                );

select * from `questions` where (`title` = '問01:' and `group_id` = 730) limit 1
---

            // Tạo hoặc lấy question (liên kết với group)
            if (!empty($row[7])) {
                $question = Question::updateOrCreate(
                    ['title' => $row[7],'group_id' => $group->id ?? null ],
                    [
                        'content' => $row[8] ?? null,
                        'mean' => $row[12] ?? null,
                         // Mean có thể là phần dịch
                        'created_at' => time(),
                        'updated_at' => time(),
                    ]
                );

insert into `answers` (`content`, `question_id`, `is_correct`, `created_at`, `updated_at`) values (' ごまんねん', 802, 0, '2024-12-30 10:07:53', '2024-12-30 10:07:53')
select * from `answers` where (`content` = ' ごまんねん' and `question_id` = 802) limit 1
---

            // Tạo hoặc lấy answer (liên kết với question)
            if (!empty($row[13])) {
                $answer = Answer::updateOrCreate(
                    ['content' => $row[13], 'question_id' => $question->id ?? null],
                    [
                        'is_correct' => strtolower($row[14]) === 'true' ? 1 : 0, // Xử lý boolean
                        'created_at' => now(),
                        'updated_at' => now(),
                    ]
                );